/*
	N = 3 = 3^1
	 0 1 2
	0* * *
	1*   *
	2* * *
	x % 3 == 1 && y % 3 == 1
	cout << " ";
	
	가운데 공백 N/3 * N/3 N/3패턴으로 둘러싼 형태

	N = 9 = 3^2
	   0     1     2
	 0 1 2 3 4 5 6 7 8 
	0* * * * * * * * * 
  0	1*   * *   * *   * 
	2* * * * * * * * *
	3* * *       * * *
  1	4*   *       *   *
	5* * *       * * *
	6* * * * * * * * *
  2	7*   * *   * *   *
	8* * * * * * * * * 
	
	(x / 3^1) % 3 == 1 && (y / 3^1) % 3 == 1
	cout << " ";

	N = 3^k
	(x/3^k-1) % 3 == 1 && (y/3^k-1) % 3 == 1

	입력값은 3^k가 들어간다.
	
*/

#include <iostream>

using namespace std;

void Print(int n, int y, int x)
{
	if (n == 0)
	{
		// n이 0이 될때까지 공백이 안나왔다면 
		// 그곳은 별이 들어갈 자리
		cout << '*';
		
		return;
	}

	// 조건에 맞으면 공백을 출력한다
	if ((x / n) % 3 == 1 && (y / n) % 3 == 1)
	{
		cout << ' ';
	}
	else
	{
		// 맞는 조건이 없다면 3으로 나눈 몫을 재귀한다
		Print(n / 3, y, x);
	}
}

int main()
{
	int N;
	cin >> N;

	for (int i = 0; i < N; i++)
	{
		for (int j = 0; j < N; j++)
		{
			Print(N, i, j);
		}
		cout << "\n";
	}
	return 0;
}