#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>

int main()
{
    int arr1[2][5] = { {0, 1, 2, 3, 4}, {5, 6, 7, 8, 9} };

    char arr3[20][10] = { 0 };

    char* arr4[10] = { 0 };
    /*
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    ¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à
    */ 

    //int* arr2[5] = arr1;

    //printf("arr1 : %d, arr2 : %d", sizeof(arr1), sizeof(arr2));
    printf("%d", sizeof(arr4));

    
}
