#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	int A, B, C;
	scanf("%d %d %d", &A, &B, &C); // ******** 입력

	int result = A * B * C; // 150 * 266 * 427 =  17037300 (8자리)

	int countForDigit[10] = { 0 }; // {0, 0, 0, 0, 0, 0, 0, 0, 0, 0} 0으로 초기화 안하면 쓰레기값이 들어간다.

	while (result != 0) // ******** 처리
	{
		int digit = result % 10; // 1의 자리를 알 수있다.
		countForDigit[digit] += 1; // 객체의 데이터를 1 증가시킨다. digit이 나온만큼 배열에 접근
		result /= 10; 
	}

	/*	
		□□□□□□□□□□
		0000000000

		■□□□□□□□□□
		1000000000

		■□□□□□□□□□
		2000000000

		■□□■□□□□□□
		2001000000

		■□□■□□□■□□
		2001000100

		■□□■□□□■□□
		2002000100

		■□□■□□□■□□
		3002000100

		■□□■□□□■□□
		3002000200

		■■□■□□□■□□
		3102000200
	*/


	for (int i = 0; i < 10; i++) // ******** 출력
	{
		printf("%d\n", countForDigit[i]);
	}
}
